// 原始专业数据
const RAW_MAJORS = [
    {
        "code": "0101",
        "name": "土木工程",
    },
    {
        "code": "0116",
        "name": "铁道工程",
    },
    {
        "code": "0117",
        "name": "城市地下空间工程",
    },
    {
        "code": "0118",
        "name": "道路桥梁与渡河工程",
    },
    {
        "code": "0119",
        "name": "工程造价",
    },
    {
        "code": "0188",
        "name": "土木工程",
    },
    {
        "code": "0201",
        "name": "机械设计制造及其自动化",
    },
    {
        "code": "0212",
        "name": "测控技术与仪器",
    },
    {
        "code": "0215",
        "name": "车辆工程",
    },
    {
        "code": "0216",
        "name": "工业工程",
    },
    {
        "code": "0218",
        "name": "能源与动力工程",
    },
    {
        "code": "0219",
        "name": "建筑环境与能源应用工程",
    },
    {
        "code": "0220",
        "name": "机械类",
    },
    {
        "code": "0222",
        "name": "交通设备与控制工程",
    },
    {
        "code": "0223",
        "name": "能源动力类",
    },
    {
        "code": "0224",
        "name": "车辆工程",
    },
    {
        "code": "0225",
        "name": "车辆工程",
    },
    {
        "code": "0288",
        "name": "机械设计制造及其自动化",
    },
    {
        "code": "0303",
        "name": "电气工程及其自动化",
    },
    {
        "code": "0305",
        "name": "电气工程及其自动化",
    },
    {
        "code": "0307",
        "name": "电子信息工程",
    },
    {
        "code": "0308",
        "name": "电气工程及其自动化",
    },
    {
        "code": "0310",
        "name": "电气类",
    },
    {
        "code": "0311",
        "name": "电气工程及其自动化",
    },
    {
        "code": "0312",
        "name": "电气工程及其自动化",
    },
    {
        "code": "0313",
        "name": "电气工程及其自动化",
    },
    {
        "code": "0314",
        "name": "电子信息工程",
    },
    {
        "code": "0315",
        "name": "电子信息工程",
    },
    {
        "code": "0317",
        "name": "电气工程与智能控制",
    },
    {
        "code": "0318",
        "name": "电气工程及其自动化",
    },
    {
        "code": "0321",
        "name": "电子信息工程",
    },
    {
        "code": "0322",
        "name": "电子信息工程",
    },
    {
        "code": "0323",
        "name": "电子信息工程",
    },
    {
        "code": "0388",
        "name": "电气工程及其自动化",
    },
    {
        "code": "0403",
        "name": "通信工程",
    },
    {
        "code": "0406",
        "name": "自动化",
    },
    {
        "code": "0407",
        "name": "信息安全",
    },
    {
        "code": "0410",
        "name": "电子科学与技术",
    },
    {
        "code": "0413",
        "name": "物联网工程",
    },
    {
        "code": "0414",
        "name": "轨道交通信号与控制",
    },
    {
        "code": "0416",
        "name": "网络工程",
    },
    {
        "code": "0417",
        "name": "电子信息类",
    },
    {
        "code": "0419",
        "name": "微电子科学与工程",
    },
    {
        "code": "0420",
        "name": "电子科学与技术",
    },
    {
        "code": "0477",
        "name": "通信工程",
    },
    {
        "code": "0501",
        "name": "交通运输",
    },
    {
        "code": "0503",
        "name": "交通工程",
    },
    {
        "code": "0505",
        "name": "安全工程",
    },
    {
        "code": "0507",
        "name": "交通运输类",
    },
    {
        "code": "0508",
        "name": "物流管理与工程类",
    },
    {
        "code": "0509",
        "name": "交通运输",
    },
    {
        "code": "0511",
        "name": "交通运输",
    },
    {
        "code": "0512",
        "name": "交通运输",
    },
    {
        "code": "0588",
        "name": "交通运输",
    },
    {
        "code": "2801",
        "name": "物流工程",
    },
    {
        "code": "2802",
        "name": "物流管理",
    },
    {
        "code": "0603",
        "name": "信息管理与信息系统",
    },
    {
        "code": "0605",
        "name": "工商管理",
    },
    {
        "code": "0606",
        "name": "会计学",
    },
    {
        "code": "0607",
        "name": "工程管理",
    },
    {
        "code": "0608",
        "name": "金融学",
    },
    {
        "code": "0609",
        "name": "电子商务",
    },
    {
        "code": "0613",
        "name": "工商管理类",
    },
    {
        "code": "0699",
        "name": "经济学",
    },
    {
        "code": "0701",
        "name": "国际经济与贸易",
    },
    {
        "code": "0703",
        "name": "经济学",
    },
    {
        "code": "2606",
        "name": "经济与贸易类",
    },
    {
        "code": "0708",
        "name": "汉语言文学",
    },
    {
        "code": "0712",
        "name": "音乐表演",
    },
    {
        "code": "0713",
        "name": "传播学",
    },
    {
        "code": "0714",
        "name": "广告学",
    },
    {
        "code": "0715",
        "name": "新闻传播学类",
    },
    {
        "code": "0799",
        "name": "汉语言文学",
    },
    {
        "code": "0801",
        "name": "英语",
    },
    {
        "code": "0802",
        "name": "日语",
    },
    {
        "code": "0803",
        "name": "德语",
    },
    {
        "code": "0804",
        "name": "法语",
    },
    {
        "code": "0806",
        "name": "翻译",
    },
    {
        "code": "0807",
        "name": "汉语国际教育",
    },
    {
        "code": "0809",
        "name": "外国语言文学类",
    },
    {
        "code": "0810",
        "name": "英语",
    },
    {
        "code": "0811",
        "name": "商务英语",
    },
    {
        "code": "0710",
        "name": "绘画",
    },
    {
        "code": "0901",
        "name": "建筑学",
    },
    {
        "code": "0905",
        "name": "城乡规划",
    },
    {
        "code": "0906",
        "name": "风景园林",
    },
    {
        "code": "0907",
        "name": "建筑类",
    },
    {
        "code": "0988",
        "name": "建筑学",
    },
    {
        "code": "1001",
        "name": "材料科学与工程",
    },
    {
        "code": "1007",
        "name": "材料科学与工程",
    },
    {
        "code": "1008",
        "name": "材料科学与工程",
    },
    {
        "code": "1009",
        "name": "材料类",
    },
    {
        "code": "1010",
        "name": "材料科学与工程",
    },
    {
        "code": "1012",
        "name": "材料科学与工程",
    },
    {
        "code": "1088",
        "name": "材料科学与工程",
    },
    {
        "code": "2403",
        "name": "材料成型及控制工程",
    },
    {
        "code": "1101",
        "name": "工程力学",
    },
    {
        "code": "1102",
        "name": "工程结构分析",
    },
    {
        "code": "1104",
        "name": "飞行器设计与工程",
    },
    {
        "code": "1105",
        "name": "工程力学",
    },
    {
        "code": "1199",
        "name": "工程力学",
    },
    {
        "code": "1201",
        "name": "数学与应用数学",
    },
    {
        "code": "1202",
        "name": "统计学",
    },
    {
        "code": "1205",
        "name": "数据科学与大数据技术",
    },
    {
        "code": "1299",
        "name": "数学与应用数学",
    },
    {
        "code": "3203",
        "name": "统计学",
    },
    {
        "code": "6301",
        "name": "少数民族预科",
    },
    {
        "code": "1301",
        "name": "电子信息科学与技术",
    },
    {
        "code": "1303",
        "name": "电子信息科学与技术",
    },
    {
        "code": "1304",
        "name": "应用物理学",
    },
    {
        "code": "1305",
        "name": "电子信息科学与技术",
    },
    {
        "code": "1399",
        "name": "应用物理学",
    },
    {
        "code": "0402",
        "name": "计算机科学与技术",
    },
    {
        "code": "0408",
        "name": "软件工程",
    },
    {
        "code": "0415",
        "name": "计算机类",
    },
    {
        "code": "0418",
        "name": "人工智能",
    },
    {
        "code": "0488",
        "name": "人工智能",
    },
    {
        "code": "0499",
        "name": "计算机科学与技术",
    },
    {
        "code": "1588",
        "name": "计算机科学与技术",
    },
    {
        "code": "1599",
        "name": "人工智能",
    },
    {
        "code": "1601",
        "name": "生物工程",
    },
    {
        "code": "1604",
        "name": "制药工程",
    },
    {
        "code": "1605",
        "name": "生物工程",
    },
    {
        "code": "1606",
        "name": "生物工程",
    },
    {
        "code": "1607",
        "name": "生物工程",
    },
    {
        "code": "1608",
        "name": "生物工程",
    },
    {
        "code": "1609",
        "name": "制药工程",
    },
    {
        "code": "1610",
        "name": "制药工程",
    },
    {
        "code": "1699",
        "name": "生物工程",
    },
    {
        "code": "1701",
        "name": "智能建造",
    },
    {
        "code": "1702",
        "name": "智能制造工程",
    },
    {
        "code": "1703",
        "name": "城市设计",
    },
    {
        "code": "1704",
        "name": "新能源科学与工程",
    },
    {
        "code": "1705",
        "name": "智慧交通",
    },
    {
        "code": "2101",
        "name": "环境工程",
    },
    {
        "code": "2105",
        "name": "环境科学与工程类",
    },
    {
        "code": "2109",
        "name": "环境工程",
    },
    {
        "code": "0324",
        "name": "大功率半导体科学与工程",
    },
    {
        "code": "0108",
        "name": "测绘工程",
    },
    {
        "code": "0109",
        "name": "地质工程",
    },
    {
        "code": "0114",
        "name": "遥感科学与技术",
    },
    {
        "code": "2102",
        "name": "消防工程",
    },
    {
        "code": "2103",
        "name": "地理信息科学",
    },
    {
        "code": "2106",
        "name": "测绘类",
    },
    {
        "code": "2107",
        "name": "资源勘查工程",
    },
    {
        "code": "2108",
        "name": "安全工程",
    },
    {
        "code": "2110",
        "name": "智能地球探测",
    },
    {
        "code": "2188",
        "name": "测绘工程",
    },
    {
        "code": "2512",
        "name": "视觉传达设计",
    },
    {
        "code": "2513",
        "name": "环境设计",
    },
    {
        "code": "2514",
        "name": "产品设计",
    },
    {
        "code": "2515",
        "name": "设计学类",
    },
    {
        "code": "2517",
        "name": "数字媒体艺术",
    },
    {
        "code": "2518",
        "name": "产品设计",
    },
    {
        "code": "0707",
        "name": "法学",
    },
    {
        "code": "0709",
        "name": "政治学与行政学",
    },
    {
        "code": "2603",
        "name": "工业工程",
    },
    {
        "code": "2604",
        "name": "公共事业管理",
    },
    {
        "code": "2901",
        "name": "法学类",
    },
    {
        "code": "1005",
        "name": "生物医学工程",
    },
    {
        "code": "2902",
        "name": "思想政治教育",
    },
    {
        "code": "1011",
        "name": "高分子材料与工程",
    },
    {
        "code": "3001",
        "name": "化学",
    },
    {
        "code": "0113",
        "name": "土木工程",
    },
    {
        "code": "0217",
        "name": "机械设计制造及其自动化",
    },
    {
        "code": "0309",
        "name": "电气工程及其自动化",
    },
    {
        "code": "0412",
        "name": "通信工程",
    },
    {
        "code": "0506",
        "name": "交通运输",
    },
    {
        "code": "0614",
        "name": "金融学",
    },
    {
        "code": "1006",
        "name": "材料科学与工程",
    },
    {
        "code": "1103",
        "name": "工程力学",
    },
    {
        "code": "1204",
        "name": "数学与应用数学",
    },
    {
        "code": "2104",
        "name": "测绘工程",
    },
    {
        "code": "2516",
        "name": "汉语言文学",
    },
    {
        "code": "3202",
        "name": "计算机科学与技术",
    },
    {
        "code": "3301",
        "name": "土木工程",
    },
    {
        "code": "3302",
        "name": "机械设计制造及其自动化",
    },
    {
        "code": "3303",
        "name": "电子信息工程",
    },
    {
        "code": "3304",
        "name": "计算机科学与技术",
    },
    {
        "code": "3305",
        "name": "材料科学与工程",
    },
    {
        "code": "5501",
        "name": "国际交换生班",
    },
    {
        "code": "5502",
        "name": "孔敬天佑高铁班",
    },
    {
        "code": "6701",
        "name": "应用心理学",
    },
    {
        "code": "04S02",
        "name": "计算机科学与技术",
    },
    {
        "code": "05S01",
        "name": "交通运输",
    },
    {
        "code": "06S07",
        "name": "工程管理",
    },
] as const;

// 去重后的专业列表
export const MAJORS = Array.from(
    new Set(RAW_MAJORS.map(major => major.name))
).map(name => ({ name }));